{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter", "modelTopology": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "batch_input_shape": [null, 48, 48, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true}}, {"class_name": "Activation", "config": {"name": "relu1", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"name": "bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true}}, {"class_name": "Activation", "config": {"name": "relu2", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true}}, {"class_name": "BatchNormalization", "config": {"name": "bn3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true}}, {"class_name": "Activation", "config": {"name": "relu3", "trainable": true, "dtype": "float32", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "gap", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout1", "trainable": true, "dtype": "float32", "rate": 0.4}}, {"class_name": "Dense", "config": {"name": "dense1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout2", "trainable": true, "dtype": "float32", "rate": 0.3}}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true}}]}, "keras_version": "2.15.0", "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv1/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv1/bias", "shape": [32], "dtype": "float32"}, {"name": "bn1/gamma", "shape": [32], "dtype": "float32"}, {"name": "bn1/beta", "shape": [32], "dtype": "float32"}, {"name": "bn1/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bn1/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2/beta", "shape": [64], "dtype": "float32"}, {"name": "bn2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv3/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3/gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3/beta", "shape": [128], "dtype": "float32"}, {"name": "bn3/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "dense1/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense1/bias", "shape": [64], "dtype": "float32"}, {"name": "output/kernel", "shape": [64, 10], "dtype": "float32"}, {"name": "output/bias", "shape": [10], "dtype": "float32"}]}]}